{
"ADF" : {
"last_name" : "ADF",
"tag_name" : "ADF",
"first_name" : [],
"rank" : [],
"bio" : "Ugandan-led Islamist rebel group based in North Kivu. In 2012, ADF increased in strength to more than 1300 combatants, of whom 800 are trained and well-equipped.",
"Burundi" : "1. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. 2. Extensive ADF recruitment networks persist throughout Burundi, Uganda and Tanzania. ",
"Rwanda" : "1. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. 2. ADF operates financial support cells in Tanzania, Burundi, Rwanda, Nairobi. ",
"Uganda" : "Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC."
},

"Agee" : {
"last_name" : "Agee",
"tag_name" : "Agee",
"first_name" : "Mugabe Shyaka",
"rank" : [],
"bio" : "Biography not given in UN report.",
"GoR" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"Kigabo" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"M23" : "Kigabo and Agee carried out M23 fundraising and recruitment efforts among Banyamulenge living in Rwanda.",
"Mutebutsi" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu."
},

"ALEC" : {
"last_name" : "ALEC",
"tag_name" : "ALEC",
"first_name" : [],
"rank" : [],
"bio" : "Armed movement created by Banyamulenge diaspora allied with M23 and MCC to create an independent republic of the Kivu.",
"M23" : "ALEC allied with MCC and M23.",
"Mai_Mai" : "1. ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba and MCC were also present. 2. ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba were also present. ",
"MCC" : "1. ALEC allied with MCC and M23. 2. ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba and MCC were also present. ",
"Rwanda" : "1. ALEC has recruited from refugee camps in Uganda and Rwanda. 2. Current president of ALEC, Tommy Tambwe, lives in Rwanda, and its vice-president Muhoza is also based in Rwanda after living in Canada since 1996. ",
"Uganda" : "ALEC has recruited from refugee camps in Uganda and Rwanda."
},

"Badege" : {
"last_name" : "Badege",
"tag_name" : "Badege",
"first_name" : "Eric",
"rank" : "Lt Col",
"bio" : "M23 focal point for Masisi; ex-CNDP and ex-FARDC.",
"M23" : "Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory.",
"Makenga" : "1. Badege and Makoma Semivumbi acted under orders of Makenga when they orchestrated the attacks in Masisi. 2. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. ",
"RAIA" : "1. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 2. Semivumbi travelled to Masisi to reinforce RAIA alongside Badege. 3. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. ",
"Semivumbi" : "1. Badege and Makoma Semivumbi acted under orders of Makenga when they orchestrated the attacks in Masisi. 2. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 3. Semivumbi travelled to Masisi to reinforce RAIA alongside Badege. 4. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. "
},

"Balinda" : {
"last_name" : "Balinda",
"tag_name" : "Balinda",
"first_name" : "Rwigamba",
"rank" : [],
"bio" : "Rwandan senator.",
"Kabarebe" : "Kabarebe and Balinda (with Rucyahana) distributed funds for M23 recruitment efforts.",
"M23" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad.",
"RPF" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad.",
"Rucyahana" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad."
},

"Bazanye" : {
"last_name" : "Bazanye",
"tag_name" : "Bazanye",
"first_name" : "Milton",
"rank" : [],
"bio" : "Kisoro (Uganda) District Chairperson.",
"M23" : "Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers.",
"Mwambutsa" : "1. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. 2. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. ",
"Nkundizana" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"UAF" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. "
},

"Burundi" : {
"last_name" : "Burundi",
"tag_name" : "Burundi",
"first_name" : [],
"rank" : [],
"bio" : "Burundian activities where no individual name was specified.",
"ADF" : "1. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. 2. Extensive ADF recruitment networks persist throughout Burundi, Uganda and Tanzania. ",
"FNL" : "FNL continues to forcibly recruit in Burundi.",
"FPM_ADN" : "The FPM/ADN website states that its president is Majambere, a Burundian living in Belgium.",
"MCC" : "Banyamulenge came from all over to join MCC, including Burundi and Uganda.",
"MCC_Rusagara" : "Burundian armed groups have allied with Rusagara.",
"Rwanda" : "Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC.",
"Uganda" : "1. Banyamulenge came from all over to join MCC, including Burundi and Uganda. 2. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. "
},

"Bwambale" : {
"last_name" : "Bwambale",
"tag_name" : "Bwambale",
"first_name" : "Kakolele",
"rank" : "Gen",
"bio" : "Former CNDP leader and sanctioned individual who also supports FOLC operations with intelligence and advice.",
"FOLC" : "Bwambale supports FOLC operations with intelligence and advice."
},

"COGAI" : {
"last_name" : "COGAI",
"tag_name" : "COGAI",
"first_name" : [],
"rank" : [],
"bio" : "An umbrella organization created in May 2012 aimed at uniting Ituri militias.",
"FRPI" : "Tibasima stayed with FRPI as part of cooperation by COGAI.",
"M23" : "M23, local businessmen and former militia members from the Hema community are the true driving forces behind COGAI.",
"Rwanda" : "A COGAI delegation travelled to Kigali to receive support.",
"Tibasima" : "Tibasima stayed with FRPI as part of cooperation by COGAI."
},

"FDLR" : {
"last_name" : "FDLR",
"tag_name" : "FDLR",
"first_name" : [],
"rank" : [],
"bio" : "Rwandan armed group with 1500-2000 rebels. Four FDLR subsectors have been deployed in zones in which they can participate and control local markets linked to mineral production.",
"FNL" : "FNL units cooperated with FDLR units.",
"M23" : "Currently, FDLR is deployed alongside Union des patriots congolais pour la paix forces allied with M23 in and around the gold market of Bunyatenge.",
"RAF" : "1. RAF continues to forcefully recruit ex-FDLR combatants. 2. RAF had deployed small units of ex-FDLR combatants to the DRC for intelligence-gathering missions and to reinforce M23. "
},

"FNL" : {
"last_name" : "FNL",
"tag_name" : "FNL",
"first_name" : [],
"rank" : [],
"bio" : "Armed group in South Kivu that relies on reinforcements from Congolese armed groups.",
"Burundi" : "FNL continues to forcibly recruit in Burundi.",
"FDLR" : "FNL units cooperated with FDLR units.",
"FRONABU" : "FRONABU is allied with FNL.",
"Mai_Mai" : "FNL supplied Mai Mai with ammunition during combat against Congolese armed forces."
},

"FOLC" : {
"last_name" : "FOLC",
"tag_name" : "FOLC",
"first_name" : [],
"rank" : [],
"bio" : "Armed group previously lead by Mai Mai leader Bana Sultani Selly. FOLC forged an alliance with M23 in June 2012.",
"Bwambale" : "Bwambale supports FOLC operations with intelligence and advice.",
"Mai_Mai" : "1. FOLC, a rebel group previously led by Mai Mai leader Bana Sultani Selly, forged an alliance with M23 with the backing of parliamentarian Nyamwisi. 2. Mai Mai leader Bana Sultani Selly was the previous leader of FOLC. ",
"Makenga" : "1. Makenga communicated regularly with FOLC. 2. FOLC members Kombi and Nyoro communicated regularly with Makenga. ",
"Mawa" : "FOLC regularly met with Ugandan military and civilian officials, including Mawa, regarding financial and military assistance for FOLC.",
"Nyamwisi" : "1. FOLC, a rebel group previously led by Mai Mai leader Bana Sultani Selly, forged an alliance with M23 with the backing of parliamentarian Nyamwisi. 2. Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda. 3. Nyamwisi promised that FOLC will lower taxes at Kasindi border crossing to Uganda. ",
"Officials" : "FOLC regularly met with Ugandan military and civilian officials, including Mawa, regarding financial and military assistance for FOLC.",
"Patandjila" : "1. Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda. 2. Nyamwisi established FOLC liason officer Patandjila in Gisenyi, Rwanda. ",
"Rwanda" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda.",
"UPDF" : "Nyamwisi promised that FOLC will lower taxes at Kasindi border crossing to Uganda."
},

"FPM_ADN" : {
"last_name" : "FPM_ADN",
"tag_name" : "FPM_ADN",
"first_name" : [],
"rank" : [],
"bio" : "FPM/ADN activities where no individual name was specified.",
"Burundi" : "The FPM/ADN website states that its president is Majambere, a Burundian living in Belgium.",
"FRONABU" : "FRONABU has been transformed into FPM, which is the armed branch of ADN.",
"MCC" : "MCC supplied food to FPM/ADN."
},

"FPM_ADN_Abdallah" : {
"last_name" : "Abdallah",
"tag_name" : "FPM_ADN_Abdallah",
"first_name" : [],
"rank" : "Col",
"bio" : "Burundian commander of FPM/ADN and MCC ally.",
"MCC_Rugombangabo" : "Rugombangabo was commanded by Abdallah of the FPM/ADN rebel group.",
"Sinduhije" : "Sinduhije financed Abdallah and Kasongo (FPM/ADN) to begin their armed struggle in DRC."
},

"FPM_ADN_Kasongo" : {
"last_name" : "Kasongo",
"tag_name" : "FPM_ADN_Kasongo",
"first_name" : "Claude",
"rank" : "Col",
"bio" : "FPM/ADN leader.",
"Sinduhije" : "Sinduhije financed Abdallah and Kasongo (FPM/ADN) to begin their armed struggle in DRC."
},

"FRONABU" : {
"last_name" : "FRONABU",
"tag_name" : "FRONABU",
"first_name" : [],
"rank" : [],
"bio" : "A group containing Burundian Tutsi combantants; now transformed into FPM (the armed branch of ADN).",
"FNL" : "FRONABU is allied with FNL.",
"FPM_ADN" : "FRONABU has been transformed into FPM, which is the armed branch of ADN.",
"Sinduhije" : "Forty Burundian Tutsi combatants with FRONABU, allied with FNL, are widely known as Sinduhije's men."
},

"FRPI" : {
"last_name" : "FRPI",
"tag_name" : "FRPI",
"first_name" : [],
"rank" : [],
"bio" : "Controls gold mine of Bavi.",
"COGAI" : "Tibasima stayed with FRPI as part of cooperation by COGAI.",
"Kabarebe" : "A delegation of militia members, including an FRPI representative, travelled to Kigali to meet Kabarebe and received a cash amount of $15,000.",
"MRPC_Bebwa" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Mugisha" : "In exchange for gold, Mugisha has delivered arms and munitions to FRPI.",
"Rutsholi" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Rwanda" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Tibasima" : "1. FRPI received several M23 envoys, includingTibasima, to persuade the rebels to launch military operations against the Congolese armed forces. 2. Tibasima stayed with FRPI as part of cooperation by COGAI. "
},

"GoR" : {
"last_name" : "GoR",
"tag_name" : "GoR",
"first_name" : [],
"rank" : [],
"bio" : "Government of Rwanda.",
"Agee" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"Kigabo" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"M23" : "M23 and the GoR have persistently reached out to armed groups in Ituri to build a coalition, but attempts have been unsuccessful.",
"MRPC" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"MRPC_Bebwa" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"Mutebutsi" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"Rutsholi" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"Tibasima" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa."
},

"GoU" : {
"last_name" : "GoU",
"tag_name" : "GoU",
"first_name" : [],
"rank" : [],
"bio" : "Government of Uganda.",
"M23" : "While lower in intensity than the involvement of the GoR, the GoU has also supported M23 by facilitating the political and military activities of M23 members and by providing technical assistance, political advice, and military support."
},

"Hakizimana" : {
"last_name" : "Hakizimana",
"tag_name" : "Hakizimana",
"first_name" : "Sendugu",
"rank" : [],
"bio" : "M23 politician.",
"Nzabirinda" : "Hakizimana recruited for M23 at Nyakivale refugee camp in Uganda, together with Nzabirinda and Ugandan officials.",
"Officials" : "Hakizimana recruited for M23 at Nyakivale refugee camp in Uganda, together with Nzabirinda and Ugandan officials."
},

"Kabarebe" : {
"last_name" : "Kabarebe",
"tag_name" : "Kabarebe",
"first_name" : "James",
"rank" : "Gen",
"bio" : "Rwandan Minister of Defence who was ultimately responsible for all M23 recruitment.",
"Balinda" : "Kabarebe and Balinda (with Rucyahana) distributed funds for M23 recruitment efforts.",
"FRPI" : "A delegation of militia members, including an FRPI representative, travelled to Kigali to meet Kabarebe and received a cash amount of $15,000.",
"Kanyana" : "Kanyana is a close collaborator of Kabarebe.",
"Kayonga" : "1. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  2. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. ",
"Lugerero" : "Kabarebe imposed Lugerero as political coordinator of M23.",
"M23" : "1. Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda. 2. Kabarebe and Nziza advised M23 how to update former CNDP demands to current political context. 3. Kabarebe and Nziza played an instrumental role in sustaining the political activities of M23.  4. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. ",
"Makenga" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 3. Kabarebe, Makenga and Ntaganda instructed Congolese armed forces officers to prepare attack in Ituri, promising material support.  4. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"Ngaruye" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Ntaganda" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 3. Kabarebe, Makenga and Ntaganda instructed Congolese armed forces officers to prepare attack in Ituri, promising material support.  4. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"Nziza" : "1. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  2. Kabarebe and Nziza advised M23 how to update former CNDP demands to current political context. 3. Kabarebe and Nziza played an instrumental role in sustaining the political activities of M23. Nziza also provides strategic advice and oversees the provision of logistical support to M23. ",
"RAF" : "Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda.",
"Rucyahana" : "Kabarebe and Rucyahana (with Balinda) distributed funds for M23 recruitment efforts.",
"Rwanda" : "Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda.",
"Senkoko" : "Kabarebe or his assistant Senkoko ordered former CNDP officers and current Congolese armed forces officers to desert and join M23."
},

"Kadida" : {
"last_name" : "Kadida",
"tag_name" : "Kadida",
"first_name" : "Kitoko",
"rank" : "Lt Col",
"bio" : "Commanded Rwanda's 305th brigade and 99th battalion in Jul 2012 Bunagana/Rutshuru attacks.",
"Kayonga" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"M23" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"RAF" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Ruvusha" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"UAF" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks."
},

"Kaina" : {
"last_name" : "Kaina",
"tag_name" : "Kaina",
"first_name" : "Innocent",
"rank" : "Col",
"bio" : "M23 Col.;  ex-RPF; ex-CNDP; ex-FARDC.",
"M23" : "Kaina has a long history of child soldier recruitment for M23.",
"Ntaganda" : "Kaina joined Ntaganda in Masisi in Apr 2012.",
"RPF" : "Kaina joined RPF in 1992.",
"Rwanda" : "Kaina was deployed in Rwanda with RPF.",
"UAF" : "Kaina travelled from Bunagana to Kasese, Uganda to recruit for M23 with the assistance of Ugandan armed forces officers.",
"Uganda" : "Kaina received training in Uganda."
},

"Kankiriho" : {
"last_name" : "Kankiriho",
"tag_name" : "Kankiriho",
"first_name" : "Patrick",
"rank" : "Brig Gen",
"bio" : "Western Division Commander of Ugandan armed forces; M23 ally and provisioner of military support.",
"Mukasa" : "Kankiriho, while overseeing provision of military support to M23, had provided orders to Mukasa.",
"RDF" : "Kankiriho currently keeps close contacts with Alexis Kagame, RDF 2nd Division commander."
},

"Kanyana" : {
"last_name" : "Kanyana",
"tag_name" : "Kanyana",
"first_name" : "Immaculée",
"rank" : [],
"bio" : "Close collaborator of Gen. Kabarebe.",
"Kabarebe" : "Kanyana is a close collaborator of Kabarebe.",
"MCC_Rusagara" : "Kanyana transferred $4000 to a confirmed courier of Rusagara."
},

"Kayihura" : {
"last_name" : "Kayihura",
"tag_name" : "Kayihura",
"first_name" : "Kale",
"rank" : "Gen",
"bio" : "Uganda's Inspector General of Police.",
"M23" : "Saleh and Kayihura met with M23 and engaged with them on a weekly basis.",
"Ndungutse" : "Kayihura held meetings with M23 in Kisoro (Uganda) and frequently sent Ndungutse, his deputy, to Kisoro to facilitate provision of support to M23. ",
"Saleh" : "Saleh and Kayihura met with M23 and engaged with them on a weekly basis."
},

"Kayonga" : {
"last_name" : "Kayonga",
"tag_name" : "Kayonga",
"first_name" : "Charles",
"rank" : "Gen",
"bio" : "Rwandan chief of staff of Rwandan armed forces.",
"Kabarebe" : "1. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  2. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. ",
"Kadida" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"M23" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Makenga" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"Ngaruye" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Ntaganda" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"RAF" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Ruvusha" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"UAF" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks."
},

"Kigabo" : {
"last_name" : "Kigabo",
"tag_name" : "Kigabo",
"first_name" : "Thomas Rusuhuzwa",
"rank" : [],
"bio" : "Chief economist of National Bank of Rwanda, formerly senior administrator of the Free University of Kigali.",
"Agee" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"GoR" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"M23" : "Kigabo and Agee carried out M23 fundraising and recruitment efforts among Banyamulenge living in Rwanda.",
"Mutebutsi" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu."
},

"Lugerero" : {
"last_name" : "Lugerero",
"tag_name" : "Lugerero",
"first_name" : "Jean-Marie Runiga",
"rank" : "Bishop",
"bio" : "M23 political coordinator.",
"Kabarebe" : "Kabarebe imposed Lugerero as political coordinator of M23."
},

"M23" : {
"last_name" : "M23",
"tag_name" : "M23",
"first_name" : [],
"rank" : [],
"bio" : "M23 activities where no individual name was specified.",
"Agee" : "Kigabo and Agee carried out M23 fundraising and recruitment efforts among Banyamulenge living in Rwanda.",
"ALEC" : "ALEC allied with MCC and M23.",
"Badege" : "Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory.",
"Balinda" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad.",
"Bazanye" : "Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers.",
"COGAI" : "M23, local businessmen and former militia members from the Hema community are the true driving forces behind COGAI.",
"FDLR" : "Currently, FDLR is deployed alongside Union des patriots congolais pour la paix forces allied with M23 in and around the gold market of Bunyatenge.",
"GoR" : "M23 and the GoR have persistently reached out to armed groups in Ituri to build a coalition, but attempts have been unsuccessful.",
"GoU" : "While lower in intensity than the involvement of the GoR, the GoU has also supported M23 by facilitating the political and military activities of M23 members and by providing technical assistance, political advice, and military support.",
"Kabarebe" : "1. Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda. 2. Kabarebe and Nziza advised M23 how to update former CNDP demands to current political context. 3. Kabarebe and Nziza played an instrumental role in sustaining the political activities of M23.  4. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. ",
"Kadida" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Kaina" : "Kaina has a long history of child soldier recruitment for M23.",
"Kayihura" : "Saleh and Kayihura met with M23 and engaged with them on a weekly basis.",
"Kayonga" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Kigabo" : "Kigabo and Agee carried out M23 fundraising and recruitment efforts among Banyamulenge living in Rwanda.",
"Mai_Mai" : "M23 has established a strong alliance with MCC commander Rusagara,  a former Mai Mai commander and ex-CNDP officer.",
"Makenga" : "1. Makenga has a long history of child soldier recruitment for M23. 2. Makenga ordered RAIA, under the command of M23, to carry out brutal ethnically-motivated attacks, burning more than 800 homes and killing hundreds of civilians in Masisi territory. 3. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. ",
"MCC" : "ALEC allied with MCC and M23.",
"MCC_Rusagara" : "M23 has established a strong alliance with MCC commander Rusagara,  a former Mai Mai commander and ex-CNDP officer.",
"MRPC" : "MRPC fighters headed from Djugu to Rutshuru to link up with M23.",
"Mukasa" : "1. Kankiriho, while overseeing provision of military support to M23, had provided orders to Mukasa. 2. Mukasa had been in charge of coordinating the provision of support to M23 at the local level. ",
"Mwambutsa" : "Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers.",
"Ndungutse" : "Kayihura held meetings with M23 in Kisoro (Uganda) and frequently sent Ndungutse, his deputy, to Kisoro to facilitate provision of support to M23. ",
"Nkunda" : "Nkunda provided advice to M23 commanders and recruited for M23 in Rwanda.",
"Nkundizana" : "Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers.",
"Ntaganda" : "1. Ntaganda's Hotel Bushokoro in Kinigi, Rwanda, hosts M23 recruits en route to DRC. 2. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 3. Ntaganda maintained strong connections with senior Ugandan armed forces officers and directly coordinated the Ugandan military support provided to M23. ",
"Nziza" : "1. Kabarebe and Nziza advised M23 how to update former CNDP demands to current political context. 2. Kabarebe and Nziza played an instrumental role in sustaining the political activities of M23. Nziza also provides strategic advice and oversees the provision of logistical support to M23. ",
"RAF" : "1. Rwandan officials used special forces units to clandestinely support M23. RAF officers have also furnished M23 with weapons, facilitated evacuation of casualties to Rwanda and shared communication equipment with M23. 2. Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda. 3. M23 further consolidated its deployments and gained additional terrain with the help of allied armed groups and continued support from Rwandan and Ugandan armed forces. 4. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. ",
"RAIA" : "1. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 2. Makenga ordered RAIA, under the command of M23, to carry out brutal ethnically-motivated attacks, burning more than 800 homes and killing hundreds of civilians in Masisi territory. ",
"RDF" : "1. RDF commanders established a network of military and civilian recruiters for M23 in most of the villages in western Rwanda and the refugee camp at Nkamira. 2. Subsequent to the M23 attacks in Bunagana, RDF units clandestinely entered DRC. 3. A portion of the taxes extorted by M23 in Rutshuru, as well as funds raised from voluntary contributions, have been shared by RDF commanders. ",
"RPF" : "1. RPF figures involved in the M23 command and mobilization also divert a portion of financial contributions to M23 for their own benefit (along with senior RDF officers). 2. Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad. ",
"RSF" : "Rwandan officials used special forces units to clandestinely support M23. RAF officers have also furnished M23 with weapons, facilitated evacuation of casualties to Rwanda and shared communication equipment with M23.",
"Rucyahana" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad.",
"Ruvusha" : "1. Ruvusha supported M23 operations in DRC. 2. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. ",
"Rwanda" : "1. Nkunda provided advice to M23 commanders and recruited for M23 in Rwanda. 2. Rwandan officials exercise overall command and strategic planning for M23. ",
"Saleh" : "1. Saleh and Kayihura met with M23 and engaged with them on a weekly basis. 2. Saleh was principally responsible for the support provided to M23 from within UAF. ",
"Semivumbi" : "Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory.",
"UAF" : "1. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. 2. M23 further consolidated its deployments and gained additional terrain with the help of allied armed groups and continued support from Rwandan and Ugandan armed forces. 3. Ntaganda maintained strong connections with senior Ugandan armed forces officers and directly coordinated the Ugandan military support provided to M23. 4. Saleh was principally responsible for the support provided to M23 from within UAF. 5. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. "
},

"Mai_Mai" : {
"last_name" : "Mai Mai",
"tag_name" : "Mai_Mai",
"first_name" : [],
"rank" : [],
"bio" : "Includes different camps such as Mai Mai Mayele, Mai Mai Yakutumba, Mai Mai Baleke and Mai Mai Fujo.",
"ALEC" : "1. ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba and MCC were also present. 2. ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba were also present. ",
"FNL" : "FNL supplied Mai Mai with ammunition during combat against Congolese armed forces.",
"FOLC" : "1. FOLC, a rebel group previously led by Mai Mai leader Bana Sultani Selly, forged an alliance with M23 with the backing of parliamentarian Nyamwisi. 2. Mai Mai leader Bana Sultani Selly was the previous leader of FOLC. ",
"M23" : "M23 has established a strong alliance with MCC commander Rusagara,  a former Mai Mai commander and ex-CNDP officer.",
"MCC" : "ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba and MCC were also present.",
"MCC_Rusagara" : "1. M23 has established a strong alliance with MCC commander Rusagara,  a former Mai Mai commander and ex-CNDP officer. 2. MCC commander Rusagara was a former Mai Mai commander. ",
"Nyamwisi" : "FOLC, a rebel group previously led by Mai Mai leader Bana Sultani Selly, forged an alliance with M23 with the backing of parliamentarian Nyamwisi."
},

"Makenga" : {
"last_name" : "Makenga",
"tag_name" : "Makenga",
"first_name" : "Sultani",
"rank" : "Col",
"bio" : "M23 military commander; ex-FARDC commander. The coordinator of the armed groups allied with M23.",
"Badege" : "1. Badege and Makoma Semivumbi acted under orders of Makenga when they orchestrated the attacks in Masisi. 2. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. ",
"FOLC" : "1. Makenga communicated regularly with FOLC. 2. FOLC members Kombi and Nyoro communicated regularly with Makenga. ",
"Kabarebe" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 3. Kabarebe, Makenga and Ntaganda instructed Congolese armed forces officers to prepare attack in Ituri, promising material support.  4. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"Kayonga" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"M23" : "1. Makenga has a long history of child soldier recruitment for M23. 2. Makenga ordered RAIA, under the command of M23, to carry out brutal ethnically-motivated attacks, burning more than 800 homes and killing hundreds of civilians in Masisi territory. 3. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. ",
"MCC_Rusagara" : "Rusagara stated that he regularly communicated with Makenga.",
"Ngaruye" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Ntaganda" : "1. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. 2. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 3. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 4. Kabarebe, Makenga and Ntaganda instructed Congolese armed forces officers to prepare attack in Ituri, promising material support.  5. Ntaganda and Makenga gave orders for the execution of at least 20 prisoners of war. 6. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"Nziza" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"RAF" : "Makenga showed M23 officers the large amounts of weapons and ammunition that RAF had donated to M23.",
"RAIA" : "1. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. 2. Makenga began supporting RAIA in early 2012. 3. Makenga ordered RAIA, under the command of M23, to carry out brutal ethnically-motivated attacks, burning more than 800 homes and killing hundreds of civilians in Masisi territory. 4. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. ",
"Ruvusha" : "Rutshuru territory attacks: Makenga had planned further details about the attacks with Ruvusha.",
"Semivumbi" : "Badege and Makoma Semivumbi acted under orders of Makenga when they orchestrated the attacks in Masisi.",
"UAF" : "1. Makenga procured weapons from UAF officers. 2. Makenga had travelled to meet Ugandan armed forces officers. 3. Makenga had procured weapons from UAF officers. ",
"Uganda" : "Makenga procured weapons from UAF officers."
},

"Mawa" : {
"last_name" : "Mawa",
"tag_name" : "Mawa",
"first_name" : "Muhindo",
"rank" : "Lt Col",
"bio" : "Resident District Commissioner of Kasese (Ugana); long-standing ally of Nyamwisi.",
"FOLC" : "FOLC regularly met with Ugandan military and civilian officials, including Mawa, regarding financial and military assistance for FOLC.",
"Nyamwisi" : "Mawa and Nyamwisi are long-standing allies.",
"Officials" : "FOLC regularly met with Ugandan military and civilian officials, including Mawa, regarding financial and military assistance for FOLC."
},

"MCC" : {
"last_name" : "MCC",
"tag_name" : "MCC",
"first_name" : [],
"rank" : [],
"bio" : "MCC activities where no individual name was specified. MCC is an alliance formed of 250 fighters from several armed groups.",
"ALEC" : "1. ALEC allied with MCC and M23. 2. ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba and MCC were also present. ",
"Burundi" : "Banyamulenge came from all over to join MCC, including Burundi and Uganda.",
"FPM_ADN" : "MCC supplied food to FPM/ADN.",
"M23" : "ALEC allied with MCC and M23.",
"Mai_Mai" : "ALEC held a meeting in Mai Mai Mayele camp. Mai Mai Yakatumba and MCC were also present.",
"Sinduhije" : "Sinduhije's men joined with MCC troops in Runingu.",
"Uganda" : "Banyamulenge came from all over to join MCC, including Burundi and Uganda."
},

"MCC_Rugombangabo" : {
"last_name" : "Rugombangabo",
"tag_name" : "MCC_Rugombangabo",
"first_name" : "Jeremy",
"rank" : [],
"bio" : "MCC officer commanded by Abdallah.",
"FPM_ADN_Abdallah" : "Rugombangabo was commanded by Abdallah of the FPM/ADN rebel group."
},

"MCC_Rusagara" : {
"last_name" : "Rusagara",
"tag_name" : "MCC_Rusagara",
"first_name" : "Bede",
"rank" : "Col",
"bio" : "Mai-Mai commander and ex-CNDP officer who is commander of MCC.",
"Burundi" : "Burundian armed groups have allied with Rusagara.",
"Kanyana" : "Kanyana transferred $4000 to a confirmed courier of Rusagara.",
"M23" : "M23 has established a strong alliance with MCC commander Rusagara,  a former Mai Mai commander and ex-CNDP officer.",
"Mai_Mai" : "1. M23 has established a strong alliance with MCC commander Rusagara,  a former Mai Mai commander and ex-CNDP officer. 2. MCC commander Rusagara was a former Mai Mai commander. ",
"Makenga" : "Rusagara stated that he regularly communicated with Makenga."
},

"MRPC" : {
"last_name" : "MRPC",
"tag_name" : "MRPC",
"first_name" : [],
"rank" : [],
"bio" : "MRPC activities where no individual name was specified.",
"GoR" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"M23" : "MRPC fighters headed from Djugu to Rutshuru to link up with M23.",
"MRPC_Bebwa" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"Rutsholi" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"Tibasima" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa."
},

"MRPC_Bebwa" : {
"last_name" : "Bebwa",
"tag_name" : "MRPC_Bebwa",
"first_name" : "John",
"rank" : "Maj",
"bio" : "Government of Rwanda envoy; joined Rutsholi's pro-M23 break-away faction of MRPC.",
"FRPI" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"GoR" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"MRPC" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"Rutsholi" : "1. Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali. 2. Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa. ",
"Rwanda" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Tibasima" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa."
},

"Mugisha" : {
"last_name" : "Mugisha",
"tag_name" : "Mugisha",
"first_name" : "Alex",
"rank" : [],
"bio" : "Former Ugandan armed forces officer; has delivered arms and munitions to FRPI.",
"FRPI" : "In exchange for gold, Mugisha has delivered arms and munitions to FRPI."
},

"Mukasa" : {
"last_name" : "Mukasa",
"tag_name" : "Mukasa",
"first_name" : "Charles",
"rank" : "Maj",
"bio" : "Commander of 63rd battalian of Ugandan armed forces based in Kisoro (Uganda); provisioner of support to M23 at local level.",
"Kankiriho" : "Kankiriho, while overseeing provision of military support to M23, had provided orders to Mukasa.",
"M23" : "1. Kankiriho, while overseeing provision of military support to M23, had provided orders to Mukasa. 2. Mukasa had been in charge of coordinating the provision of support to M23 at the local level. "
},

"Mutebutsi" : {
"last_name" : "Mutebutsi",
"tag_name" : "Mutebutsi",
"first_name" : "Jules",
"rank" : "Col",
"bio" : "M23 ally; sanctioned individual hoping for a military return to DRC after brief takeover of Bukavu in 2004.",
"Agee" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"GoR" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"Kigabo" : "The Government of Rwanda tasked Mutebutsi, Kigabo and Agee with instigating an armed rebellion in South Kivu.",
"Rwanda" : "Mutebutsi lives in Rwanda since 2004 brief takeover of Bukavu."
},

"Mwambutsa" : {
"last_name" : "Mwambutsa",
"tag_name" : "Mwambutsa",
"first_name" : "Vincent",
"rank" : [],
"bio" : "Jomba locality chief based in Bunagana.",
"Bazanye" : "1. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. 2. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. ",
"M23" : "Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers.",
"Nkundizana" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"UAF" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. "
},

"Ndungutse" : {
"last_name" : "Ndungutse",
"tag_name" : "Ndungutse",
"first_name" : "John Ngaruye",
"rank" : [],
"bio" : "Kayihura's deputy in charge of counter-terrorism; M23 ally who facilitates provisions.",
"Kayihura" : "Kayihura held meetings with M23 in Kisoro (Uganda) and frequently sent Ndungutse, his deputy, to Kisoro to facilitate provision of support to M23. ",
"M23" : "Kayihura held meetings with M23 in Kisoro (Uganda) and frequently sent Ndungutse, his deputy, to Kisoro to facilitate provision of support to M23. "
},

"Ngaruye" : {
"last_name" : "Ngaruye",
"tag_name" : "Ngaruye",
"first_name" : "Baudouin",
"rank" : "Col",
"bio" : "Makenga's deputy in charge of M23 operations.",
"Kabarebe" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Kayonga" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Makenga" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Ntaganda" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Nziza" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. "
},

"Nkunda" : {
"last_name" : "Nkunda",
"tag_name" : "Nkunda",
"first_name" : "Laurent",
"rank" : "Gen",
"bio" : "A sanctioned individual; ex-CNDP leader.",
"M23" : "Nkunda provided advice to M23 commanders and recruited for M23 in Rwanda.",
"Rwanda" : "Nkunda provided advice to M23 commanders and recruited for M23 in Rwanda.",
"UAF" : "Senior Ugandan armed forces officers have cooperated with Nkunda and allowed him to visit and acquire a residence in Kampala, Uganda, in violation of the travel ban and assets freeze."
},

"Nkundizana" : {
"last_name" : "Nkundizana",
"tag_name" : "Nkundizana",
"first_name" : "Willbaforce",
"rank" : [],
"bio" : "Ally of Kisoro District Chairperson Milton Bazanye.",
"Bazanye" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"M23" : "Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers.",
"Mwambutsa" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"UAF" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. "
},

"Ntaganda" : {
"last_name" : "Ntaganda",
"tag_name" : "Ntaganda",
"first_name" : "Bosco",
"rank" : "Gen",
"bio" : "MM23 head, aka The Terminator, born in Rwanda; ex-RPA; ex-UPC Chief of Staff; ex-CNDP military chief of staff; owns hotel in Kinigi, Rwanda, surrounded by RPF protection unit; commanded Raia, FDC-Luanda, NDC; oversees mineral smuggling networks through Goma.",
"Kabarebe" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 3. Kabarebe, Makenga and Ntaganda instructed Congolese armed forces officers to prepare attack in Ituri, promising material support.  4. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"Kaina" : "Kaina joined Ntaganda in Masisi in Apr 2012.",
"Kayonga" : "1. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 2. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"M23" : "1. Ntaganda's Hotel Bushokoro in Kinigi, Rwanda, hosts M23 recruits en route to DRC. 2. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 3. Ntaganda maintained strong connections with senior Ugandan armed forces officers and directly coordinated the Ugandan military support provided to M23. ",
"Makenga" : "1. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. 2. Ntaganda and Makenga received direct military orders from Kayonga, who in turn acted on instructions from Kabarebe. 3. Ntaganda, Makenga and Kabarebe contacted an M23 collaborator in Ituri on several occasions. 4. Kabarebe, Makenga and Ntaganda instructed Congolese armed forces officers to prepare attack in Ituri, promising material support.  5. Ntaganda and Makenga gave orders for the execution of at least 20 prisoners of war. 6. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  ",
"Ngaruye" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Nziza" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"RAIA" : "1. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. 2. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. Ntganda has been instrumental in the arming of RAIA. ",
"RDF" : "1. Ntaganda and RDF officers tasked a former RDF officer based in a FARDC unit to travel to Rwanda and mobilize Rwandan citizens to be brought to DRC and clandestinely integrated into FARDC. 2. RDF soldiers were part of Ntaganda's close protection unit. ",
"Rutsholi" : "Ntaganda sent instructions to the group led by Rutsholi to recover arms caches that he left in Ituri.",
"Rwanda" : "1. Ntaganda continues to be based a few km away from the Rwandan border and regularly travels to Rwanda, violating the travel ban. 2. Ntaganda's Hotel Bushokoro in Kinigi, Rwanda, hosts M23 recruits en route to DRC. ",
"UAF" : "Ntaganda maintained strong connections with senior Ugandan armed forces officers and directly coordinated the Ugandan military support provided to M23.",
"Uganda" : "Ntaganda oversaw smuggling of gold through Kampala obtained by Ntaganda's long-standing collaboration with armed groups. The revenues of these sales went towards M23. Ntaganda previously collaborated with a network of scam artists in Kampala and Nairobi."
},

"Ntibaturana" : {
"last_name" : "Ntibaturana",
"tag_name" : "Ntibaturana",
"first_name" : "Erasto",
"rank" : [],
"bio" : "M23 member currently living in Gisenye (Rwanda).",
"Rwanda" : "Minerals are stocked in a depot in Busumba belonging to M23 member Ntibaturana, who currently lives in Gisenye, Rwanda."
},

"Nyamwisi" : {
"last_name" : "Nyamwisi",
"tag_name" : "Nyamwisi",
"first_name" : "Antipas Mbusa",
"rank" : [],
"bio" : "Congolese parliamentarian who has recruited politicians for FOLC and M23.",
"FOLC" : "1. FOLC, a rebel group previously led by Mai Mai leader Bana Sultani Selly, forged an alliance with M23 with the backing of parliamentarian Nyamwisi. 2. Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda. 3. Nyamwisi promised that FOLC will lower taxes at Kasindi border crossing to Uganda. ",
"Mai_Mai" : "FOLC, a rebel group previously led by Mai Mai leader Bana Sultani Selly, forged an alliance with M23 with the backing of parliamentarian Nyamwisi.",
"Mawa" : "Mawa and Nyamwisi are long-standing allies.",
"Patandjila" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda.",
"Rwanda" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda.",
"Uganda" : "Nyamwisi promised that FOLC will lower taxes at Kasindi border crossing to Uganda."
},

"Nzabirinda" : {
"last_name" : "Nzabirinda",
"tag_name" : "Nzabirinda",
"first_name" : "Déogratias",
"rank" : [],
"bio" : "M23 politician",
"Hakizimana" : "Hakizimana recruited for M23 at Nyakivale refugee camp in Uganda, together with Nzabirinda and Ugandan officials.",
"Officials" : "Hakizimana recruited for M23 at Nyakivale refugee camp in Uganda, together with Nzabirinda and Ugandan officials."
},

"Nziza" : {
"last_name" : "Nziza",
"tag_name" : "Nziza",
"first_name" : "Jacques",
"rank" : "Gen",
"bio" : "M23 strategic advisor who also oversaw logistical support to M23; permanent Secretary of Rwanda's Ministry of Defence.",
"Kabarebe" : "1. Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks.  2. Kabarebe and Nziza advised M23 how to update former CNDP demands to current political context. 3. Kabarebe and Nziza played an instrumental role in sustaining the political activities of M23. Nziza also provides strategic advice and oversees the provision of logistical support to M23. ",
"M23" : "1. Kabarebe and Nziza advised M23 how to update former CNDP demands to current political context. 2. Kabarebe and Nziza played an instrumental role in sustaining the political activities of M23. Nziza also provides strategic advice and oversees the provision of logistical support to M23. ",
"Makenga" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Ngaruye" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. ",
"Ntaganda" : "Rutshuru territory attacks: Ntaganda, Makenga and Ngaruye had travelled to Rwanda to meet Kabarebe, Nziza and Kayonga to plan the attacks. "
},

"Officials" : {
"last_name" : "Officials",
"tag_name" : "Officials",
"first_name" : [],
"rank" : [],
"bio" : "Various Ugandan officials.",
"FOLC" : "FOLC regularly met with Ugandan military and civilian officials, including Mawa, regarding financial and military assistance for FOLC.",
"Hakizimana" : "Hakizimana recruited for M23 at Nyakivale refugee camp in Uganda, together with Nzabirinda and Ugandan officials.",
"Mawa" : "FOLC regularly met with Ugandan military and civilian officials, including Mawa, regarding financial and military assistance for FOLC.",
"Nzabirinda" : "Hakizimana recruited for M23 at Nyakivale refugee camp in Uganda, together with Nzabirinda and Ugandan officials."
},

"Patandjila" : {
"last_name" : "Patandjila",
"tag_name" : "Patandjila",
"first_name" : "Andy",
"rank" : [],
"bio" : "FOLC liason officer established in Gisenyi, Rwanda, by Nyamwisi.",
"FOLC" : "1. Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda. 2. Nyamwisi established FOLC liason officer Patandjila in Gisenyi, Rwanda. ",
"Nyamwisi" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda.",
"Rwanda" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda."
},

"RAF" : {
"last_name" : "RAF",
"tag_name" : "RAF",
"first_name" : [],
"rank" : [],
"bio" : "Rwandan Armed Forces.",
"FDLR" : "1. RAF continues to forcefully recruit ex-FDLR combatants. 2. RAF had deployed small units of ex-FDLR combatants to the DRC for intelligence-gathering missions and to reinforce M23. ",
"Kabarebe" : "Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda.",
"Kadida" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Kayonga" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"M23" : "1. Rwandan officials used special forces units to clandestinely support M23. RAF officers have also furnished M23 with weapons, facilitated evacuation of casualties to Rwanda and shared communication equipment with M23. 2. Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda. 3. M23 further consolidated its deployments and gained additional terrain with the help of allied armed groups and continued support from Rwandan and Ugandan armed forces. 4. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. ",
"Makenga" : "Makenga showed M23 officers the large amounts of weapons and ammunition that RAF had donated to M23.",
"RSF" : "Rwandan officials used special forces units to clandestinely support M23. RAF officers have also furnished M23 with weapons, facilitated evacuation of casualties to Rwanda and shared communication equipment with M23.",
"Ruvusha" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"UAF" : "1. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. 2. M23 further consolidated its deployments and gained additional terrain with the help of allied armed groups and continued support from Rwandan and Ugandan armed forces. "
},

"RAIA" : {
"last_name" : "Raia Mutomboki",
"tag_name" : "RAIA",
"first_name" : [],
"rank" : [],
"bio" : "Armed group with an established presence in southern Masisi and forms part of the broad coalition of armed groups within the M23 movement.",
"Badege" : "1. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 2. Semivumbi travelled to Masisi to reinforce RAIA alongside Badege. 3. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. ",
"M23" : "1. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 2. Makenga ordered RAIA, under the command of M23, to carry out brutal ethnically-motivated attacks, burning more than 800 homes and killing hundreds of civilians in Masisi territory. ",
"Makenga" : "1. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. 2. Makenga began supporting RAIA in early 2012. 3. Makenga ordered RAIA, under the command of M23, to carry out brutal ethnically-motivated attacks, burning more than 800 homes and killing hundreds of civilians in Masisi territory. 4. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. ",
"Ntaganda" : "1. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. 2. Ntaganda and Makenga gave orders to RAIA, FDC-Luanda and NDC to facilitate further M23 expansion. Ntganda has been instrumental in the arming of RAIA. ",
"Semivumbi" : "1. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 2. Semivumbi travelled to Masisi to reinforce RAIA alongside Badege. 3. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. "
},

"RDF" : {
"last_name" : "RDF",
"tag_name" : "RDF",
"first_name" : [],
"rank" : [],
"bio" : "Rwandan Defence Forces.",
"Kankiriho" : "Kankiriho currently keeps close contacts with Alexis Kagame, RDF 2nd Division commander.",
"M23" : "1. RDF commanders established a network of military and civilian recruiters for M23 in most of the villages in western Rwanda and the refugee camp at Nkamira. 2. Subsequent to the M23 attacks in Bunagana, RDF units clandestinely entered DRC. 3. A portion of the taxes extorted by M23 in Rutshuru, as well as funds raised from voluntary contributions, have been shared by RDF commanders. ",
"Ntaganda" : "1. Ntaganda and RDF officers tasked a former RDF officer based in a FARDC unit to travel to Rwanda and mobilize Rwandan citizens to be brought to DRC and clandestinely integrated into FARDC. 2. RDF soldiers were part of Ntaganda's close protection unit. ",
"RPF" : "Senior RDF officers, as well as RPF figures involved in the M23 command and mobilization, divert a portion of the financial contributions collected on behalf of M23 for their own benefit.",
"UPDF" : "RDF and UPDF officers extensively discussed options for extending their spheres of influence and economic gains in eastern DRC using the M23."
},

"RPF" : {
"last_name" : "RPF",
"tag_name" : "RPF",
"first_name" : [],
"rank" : [],
"bio" : "Rwandan Patriotic Front.",
"Balinda" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad.",
"Kaina" : "Kaina joined RPF in 1992.",
"M23" : "1. RPF figures involved in the M23 command and mobilization also divert a portion of financial contributions to M23 for their own benefit (along with senior RDF officers). 2. Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad. ",
"RDF" : "Senior RDF officers, as well as RPF figures involved in the M23 command and mobilization, divert a portion of the financial contributions collected on behalf of M23 for their own benefit.",
"Rucyahana" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad."
},

"RSF" : {
"last_name" : "RSF",
"tag_name" : "RSF",
"first_name" : [],
"rank" : [],
"bio" : "Rwandan special forces deployed to support M23.",
"M23" : "Rwandan officials used special forces units to clandestinely support M23. RAF officers have also furnished M23 with weapons, facilitated evacuation of casualties to Rwanda and shared communication equipment with M23.",
"RAF" : "Rwandan officials used special forces units to clandestinely support M23. RAF officers have also furnished M23 with weapons, facilitated evacuation of casualties to Rwanda and shared communication equipment with M23."
},

"Rucogoza" : {
"last_name" : "Rucogoza",
"tag_name" : "Rucogoza",
"first_name" : "Francois Tuihimbaze",
"rank" : [],
"bio" : "M23 Executive Secretary; former North Kivu Minister of Justice.",
"Rwanda" : "Rucogoza participates in M23 recruitment in Gisenyi, Rwanda."
},

"Rucyahana" : {
"last_name" : "Rucyahana",
"tag_name" : "Rucyahana",
"first_name" : "John",
"rank" : [],
"bio" : "Rwandan bishop and RPF member.",
"Balinda" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad.",
"Kabarebe" : "Kabarebe and Rucyahana (with Balinda) distributed funds for M23 recruitment efforts.",
"M23" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad.",
"RPF" : "Balinda and Rucyahana, both RPF members, oversaw recruiting and fundraising for M23 in Rwanda and abroad."
},

"Rutsholi" : {
"last_name" : "Rutsholi",
"tag_name" : "Rutsholi",
"first_name" : "Papy Maky",
"rank" : "Lt Col",
"bio" : "M23 Lt Col.",
"FRPI" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"GoR" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"MRPC" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"MRPC_Bebwa" : "1. Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali. 2. Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa. ",
"Ntaganda" : "Ntaganda sent instructions to the group led by Rutsholi to recover arms caches that he left in Ituri.",
"Rwanda" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Tibasima" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa."
},

"Ruvusha" : {
"last_name" : "Ruvusha",
"tag_name" : "Ruvusha",
"first_name" : "Emmanuel",
"rank" : "Gen",
"bio" : "Manages provision of military ground support for M23; Western Division Commander of Rwandan army.",
"Kadida" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Kayonga" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"M23" : "1. Ruvusha supported M23 operations in DRC. 2. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. ",
"Makenga" : "Rutshuru territory attacks: Makenga had planned further details about the attacks with Ruvusha.",
"RAF" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"UAF" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks."
},

"Rwanda" : {
"last_name" : "Rwanda",
"tag_name" : "Rwanda",
"first_name" : [],
"rank" : [],
"bio" : "Rwandan activities where no individual name was specified.",
"ADF" : "1. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. 2. ADF operates financial support cells in Tanzania, Burundi, Rwanda, Nairobi. ",
"ALEC" : "1. ALEC has recruited from refugee camps in Uganda and Rwanda. 2. Current president of ALEC, Tommy Tambwe, lives in Rwanda, and its vice-president Muhoza is also based in Rwanda after living in Canada since 1996. ",
"Burundi" : "Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC.",
"COGAI" : "A COGAI delegation travelled to Kigali to receive support.",
"FOLC" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda.",
"FRPI" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Kabarebe" : "Kabarebe was ultimately responsible for all M23 recruitment and he ordered loyal Rwandan armed forces officers to facilitate recruitment operations within Rwanda.",
"Kaina" : "Kaina was deployed in Rwanda with RPF.",
"M23" : "1. Nkunda provided advice to M23 commanders and recruited for M23 in Rwanda. 2. Rwandan officials exercise overall command and strategic planning for M23. ",
"MRPC_Bebwa" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Mutebutsi" : "Mutebutsi lives in Rwanda since 2004 brief takeover of Bukavu.",
"Nkunda" : "Nkunda provided advice to M23 commanders and recruited for M23 in Rwanda.",
"Ntaganda" : "1. Ntaganda continues to be based a few km away from the Rwandan border and regularly travels to Rwanda, violating the travel ban. 2. Ntaganda's Hotel Bushokoro in Kinigi, Rwanda, hosts M23 recruits en route to DRC. ",
"Ntibaturana" : "Minerals are stocked in a depot in Busumba belonging to M23 member Ntibaturana, who currently lives in Gisenye, Rwanda.",
"Nyamwisi" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda.",
"Patandjila" : "Nyamwisi travelled several times to meet Rwandan officials and established FOLC liaison officer Patandjila in Gisenyi, Rwanda.",
"Rucogoza" : "Rucogoza participates in M23 recruitment in Gisenyi, Rwanda.",
"Rutsholi" : "Rutsholi and Bebwa engaged with FRPI regarding collaborations with M23 after receiving a briefing in Kigali.",
"Uganda" : "1. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. 2. ALEC has recruited from refugee camps in Uganda and Rwanda. "
},

"Saleh" : {
"last_name" : "Saleh",
"tag_name" : "Saleh",
"first_name" : "Salim",
"rank" : [],
"bio" : " Military advisor to Ugandan president; M23 ally and military supporter.",
"Kayihura" : "Saleh and Kayihura met with M23 and engaged with them on a weekly basis.",
"M23" : "1. Saleh and Kayihura met with M23 and engaged with them on a weekly basis. 2. Saleh was principally responsible for the support provided to M23 from within UAF. ",
"UAF" : "Saleh was principally responsible for the support provided to M23 from within UAF."
},

"Semivumbi" : {
"last_name" : "Semivumbi",
"tag_name" : "Semivumbi",
"first_name" : "Makoma",
"rank" : "Col",
"bio" : "Former CNDP Colonel.",
"Badege" : "1. Badege and Makoma Semivumbi acted under orders of Makenga when they orchestrated the attacks in Masisi. 2. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 3. Semivumbi travelled to Masisi to reinforce RAIA alongside Badege. 4. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. ",
"M23" : "Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory.",
"Makenga" : "Badege and Makoma Semivumbi acted under orders of Makenga when they orchestrated the attacks in Masisi.",
"RAIA" : "1. Badege became the focal point of M23 in Masisi and commanded joint operations with RAIA, reinforced by Semivumbi, and other groups to destabilize a considerable part of the territory. 2. Semivumbi travelled to Masisi to reinforce RAIA alongside Badege. 3. Makoma Semivumbi and Badege acted under Makenga's orders when they orchestrated attacks in Masisi; Badege, RAIA, and other armed groups carried out attacks in Masisi, enabling M23 to destabilize a considerable part of the territory. "
},

"Senkoko" : {
"last_name" : "Senkoko",
"tag_name" : "Senkoko",
"first_name" : "Celestin",
"rank" : "Capt",
"bio" : "Kabarebe's assistant.",
"Kabarebe" : "Kabarebe or his assistant Senkoko ordered former CNDP officers and current Congolese armed forces officers to desert and join M23."
},

"Sinduhije" : {
"last_name" : "Sinduhije",
"tag_name" : "Sinduhije",
"first_name" : "Alexis",
"rank" : [],
"bio" : "Burundian opposition leader.",
"FPM_ADN_Abdallah" : "Sinduhije financed Abdallah and Kasongo (FPM/ADN) to begin their armed struggle in DRC.",
"FPM_ADN_Kasongo" : "Sinduhije financed Abdallah and Kasongo (FPM/ADN) to begin their armed struggle in DRC.",
"FRONABU" : "Forty Burundian Tutsi combatants with FRONABU, allied with FNL, are widely known as Sinduhije's men.",
"MCC" : "Sinduhije's men joined with MCC troops in Runingu."
},

"Tibasima" : {
"last_name" : "Tibasima",
"tag_name" : "Tibasima",
"first_name" : "John",
"rank" : [],
"bio" : "M23 envoy to FRPI and Govt of Rw envoy; ex-CNDP cadre and Ituri miltiaman; a lawyer who remains close to Chief Kawa of PUSIC.",
"COGAI" : "Tibasima stayed with FRPI as part of cooperation by COGAI.",
"FRPI" : "1. FRPI received several M23 envoys, includingTibasima, to persuade the rebels to launch military operations against the Congolese armed forces. 2. Tibasima stayed with FRPI as part of cooperation by COGAI. ",
"GoR" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"MRPC" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"MRPC_Bebwa" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa.",
"Rutsholi" : "Rutsholi leads pro-M23 breakaway faction of MRPC, which includes Government of Rwanda envoys like Tibasima and Bebwa."
},

"UAF" : {
"last_name" : "UAF",
"tag_name" : "UAF",
"first_name" : [],
"rank" : [],
"bio" : "Ugandan armed forces commanders.",
"Bazanye" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"Kadida" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Kaina" : "Kaina travelled from Bunagana to Kasese, Uganda to recruit for M23 with the assistance of Ugandan armed forces officers.",
"Kayonga" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"M23" : "1. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. 2. M23 further consolidated its deployments and gained additional terrain with the help of allied armed groups and continued support from Rwandan and Ugandan armed forces. 3. Ntaganda maintained strong connections with senior Ugandan armed forces officers and directly coordinated the Ugandan military support provided to M23. 4. Saleh was principally responsible for the support provided to M23 from within UAF. 5. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"Makenga" : "1. Makenga procured weapons from UAF officers. 2. Makenga had travelled to meet Ugandan armed forces officers. 3. Makenga had procured weapons from UAF officers. ",
"Mwambutsa" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"Nkunda" : "Senior Ugandan armed forces officers have cooperated with Nkunda and allowed him to visit and acquire a residence in Kampala, Uganda, in violation of the travel ban and assets freeze.",
"Nkundizana" : "1. Mwambutsa, Bazanye, Nkundizana and Ugandan armed forces officers helped organize recruitment for and financial contributions to M23. 2. Mwambutsa regularly travelled to Kisoro (Uganda) to organize recruitment for and financial contributions to M23 with Kisoro District Chairperson Bazanye, Nkundizana, and local UAF officers. ",
"Ntaganda" : "Ntaganda maintained strong connections with senior Ugandan armed forces officers and directly coordinated the Ugandan military support provided to M23.",
"RAF" : "1. Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks. 2. M23 further consolidated its deployments and gained additional terrain with the help of allied armed groups and continued support from Rwandan and Ugandan armed forces. ",
"Ruvusha" : "Rutshuru territory attacks: part of Kadida's RAF units under the coordination of Ruvushu and overall command of Kayonga operated alongside M23 and provided logistical support during the attacks. UAF commanders also supported the attacks.",
"Saleh" : "Saleh was principally responsible for the support provided to M23 from within UAF."
},

"Uganda" : {
"last_name" : "Uganda ",
"tag_name" : "Uganda",
"first_name" : [],
"rank" : [],
"bio" : "Ugandan activities where no individual name was specified.",
"ADF" : "Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC.",
"ALEC" : "ALEC has recruited from refugee camps in Uganda and Rwanda.",
"Burundi" : "1. Banyamulenge came from all over to join MCC, including Burundi and Uganda. 2. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. ",
"Kaina" : "Kaina received training in Uganda.",
"Makenga" : "Makenga procured weapons from UAF officers.",
"MCC" : "Banyamulenge came from all over to join MCC, including Burundi and Uganda.",
"Ntaganda" : "Ntaganda oversaw smuggling of gold through Kampala obtained by Ntaganda's long-standing collaboration with armed groups. The revenues of these sales went towards M23. Ntaganda previously collaborated with a network of scam artists in Kampala and Nairobi.",
"Nyamwisi" : "Nyamwisi promised that FOLC will lower taxes at Kasindi border crossing to Uganda.",
"Rwanda" : "1. Couriers transport financial resources generated by support cells in Tanga (Tanzania), Bujumbura, Kigali and Nairobi to ADF from Uganda to DRC. 2. ALEC has recruited from refugee camps in Uganda and Rwanda. "
},

"UPDF" : {
"last_name" : "UPDF",
"tag_name" : "UPDF",
"first_name" : [],
"rank" : [],
"bio" : "Uganda People's Defense Force, Uganda's armed forces.",
"FOLC" : "Nyamwisi promised that FOLC will lower taxes at Kasindi border crossing to Uganda.",
"RDF" : "RDF and UPDF officers extensively discussed options for extending their spheres of influence and economic gains in eastern DRC using the M23."
}
}